{
    "Title": "Кредитный калькулятор",
    "Header": {
        "Menu": [
            "Файл",
            "Редактирование",
            "Инструменты",
            "Справка"
        ],
        "File": [
            "Новый расчет",
            "Открыть",
            "Сохранить",
            "Сохранить как...",
            "Импорт",
            "Экспорт",
            "Выход"
        ],
        "Edit": [
            "Отменить",
            "Повторить",
            "Настройки"
        ],
        "Tools": [
            "Конвертер валют",
            "Калькулятор депозита"
        ],
        "Help": [
            "Помощь",
            "О программе"
        ]
    },

    "Currencies": [
        "₽", 
        "€", 
        "$", 
        "¥"
    ],

    "Period_units": [
        "лет", 
        "месяцев", 
        "дней"
    ],

    "Rate_per_units": [
        "% в год", 
        "% в месяц", 
        "% в день"
    ],

    "LabelsForMainEntries":[
        "Сумма кредита:",
        "Срок кредита:",
        "Процент:"
    ],
    "LabelForTypeDebt": "Выберите тип кредита:",
    "TypesDebt": [
        "аннуитетный",
        "дифференцированный"
    ],
    "LabelsForAdditionalEntries":[
        "Первоначальный взнос:",
        "Единовременная комиссия:",
        "Ежемесячная комиссия:"
    ],
    "DateEntry":{
        "labeldate": "Начало выплат: ",
        "locale": "ru_RU"
    },
    "CombosForAdditionalEntries":[
        "у.е.",
        "% от суммы кредита"
    ],
    "Buttons":{
        "mainExecute": "Рассчитать"
    },
    "MainResults":{
        "monthly_payment":"Ежемесячный платеж: ",
        "total_payment":"Всего выплат: ",
        "overpayment":"Переплата: ",
        "overpayment_percantage": "Переплата в процентах: "
    },
    "About_us_Text":{
        "Name":"СTk Кредитный калькулятор",
        "Version":"1.1.0",
        "Object":"Удобный инструмент для рассчета выплат по кредиту и общей стоимости",
        "License":"ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНО ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ, СООТВЕТСТВИЯ ПО ЕГО КОНКРЕТНОМУ НАЗНАЧЕНИЮ И ОТСУТСТВИЯ НАРУШЕНИЙ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ. НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО ИСКАМ, ЗА УЩЕРБ ИЛИ ПО ИНЫМ ТРЕБОВАНИЯМ, В ТОМ ЧИСЛЕ, ПРИ ДЕЙСТВИИ КОНТРАКТА, ДЕЛИКТЕ ИЛИ ИНОЙ СИТУАЦИИ, ВОЗНИКШИМ ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ИНЫХ ДЕЙСТВИЙ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.",
        "Github":"https://github.com/lambdaD",
        "Thanks":"Благодарность Tom Schimansky (https://github.com/TomSchimansky) за предоставление современной библиотеки для построение GUI на Python"
    },
    "Help_Text":{
        "Loan": {
            "Header": "Кредитный калькулятор",
            "Article": "Кредитный калькулятор (калькулятор кредита банков) – для онлайн расчета суммы платежа, переплаты, реальной процентной ставки или полной стоимости кредита, которую должны раскрывать как СберБанк так и другие коммерческие банки. Так же вы сможете узнать, какая часть выплат идет на погашение основной кредитной суммы, а какая часть на погашение процентов по кредиту. Данный калькулятор кредитов дает возможность онлайн расчета по двум видам платежей: аннуитетный платеж - это равный по сумме ежемесячный платеж по кредиту, который включает в себя сумму начисленных процентов за кредит банка и сумму основного долга, применяется в большинстве коммерческих банков;  дифференцированный платеж -  это ежемесячный платеж, уменьшающийся к концу срока кредитования, и состоит из выплачиваемой постоянной доли основного долга и процентов на невыплаченный остаток кредита, часто использует СберБанк. Кредитный калькулятор – применяется , для сравнения различных типов займов и получения нужной информации не прибегая к помощи банковских специалистов."
        },
        "Loan Calculation": {
            "Header": "Расчет кредита онлайн",
            "Article": "Вы можете брать кредит в любом из банков, при этом займ может быть потребительским, ипотечным или кредитом наличными — в любом из случаев вам пригодится кредитный калькулятор. Его точность будет достаточной для сравнения предложений от разных банков. \nВ результате у вас будет информация о:\nразмере ежемесячного платежа;\nсумме начисляемых процентов;\nграфике выплаты помесячно.\nполной стоимости кредита."
        },
        "Loan Rate": {
            "Header": "Процентная ставка по кредиту",
            "Article": "Процентная ставка — важнейший критерий, который следует оценивать перед взятием кредита. Единица измерения кредитной ставки — проценты годовых. Он демонстрирует количество начисляемых процентов на долг за один год. По факту, годовая ставка дробится на 365 дней и начисляется ежедневно. Каждый банк имеет свои принципы выдачи кредитов, а также ставки по процентам.\nФакторы, которые влияют на формирование кредитной ставки: \nКлючевая ставка ЦБ РФ. Банк выдает вам не свои деньги, а те, которые он сам взял в кредит у центрального банка по ключевой ставке. Чтобы заработать, банк прибавляет к ключевой ставке дополнительные проценты. Чем ниже ключевая ставка, тем выгоднее будет брать кредит, так как переплата будет меньше. Регулярно проводятся заседания ЦБ, в ходе которых корректируется ключевая ставка. Она может стать как больше, так и меньше — все зависит от экономического положения страны на мировой арене.\nТип кредита. Чем меньше банк уверен в надежности кредита, тем больше вам придется по нему переплатить. К примеру, у ипотеки кредитная ставка гораздо ниже, чем у потребительского кредита, так как в таком случае у банка в залоге остается приобретенная недвижимость. В других же случаях у банка мало гарантий того, что заемщик будет стабильно выплачивать кредит, поэтому и процентная ставка выше.\nХарактеристики заемщика. В первую очередь, это кредитная история и качество ваших взаимодействий с конкретным банком. Сотрудники банка гарантировано будут оценивать кредитную историю заемщика, чтобы на ее основе принять решение как о факте выдачи кредита, так и о процентной ставке. Чем лучше история, тем ниже будут проценты. У зарплатных клиентов банка есть возможность воспользоваться скидкой от 0.3 до 0.6 процента."
        }
    },
    "Error Messages":{
        "Value Error":{
            "Title":"Ошибка данных",
            "Text":"Введите корректные данные в поля"
        }
    }
    
}